; ModuleID = '/tmp/difference_angle3d-bcb199.ll'
source_filename = "/tmp/difference_angle3d-bcb199.ll"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%structtype_angle3d__angle3d_td_ = type <{ [8 x i64], [6 x i8*], [24 x i8] }>
%struct.BSS8 = type <{ [48 x i8] }>
%struct.angle3d = type <{ float, float, float, float }>
%struct.angle3d.1 = type <{ float, float, float, float }>

@type_angle3d__angle3d_td_ = global %structtype_angle3d__angle3d_td_ <{ [8 x i64] [i64 43, i64 33, i64 0, i64 16, i64 0, i64 0, i64 0, i64 0], [6 x i8*] [i8* null, i8* bitcast (%structtype_angle3d__angle3d_td_* @type_angle3d__angle3d_td_ to i8*), i8* null, i8* null, i8* null, i8* null], [24 x i8] c"type_angle3d$$angle3d$td" }>
@.C335_type_angle3d_angle3d_deg_ = internal constant float 0x3F91DF46A0000000
@.C366_type_angle3d_difference_angle3d_ = internal constant float 0x3810000000000000
@.C365_type_angle3d_difference_angle3d_ = internal constant i32 2
@.C364_type_angle3d_difference_angle3d_ = internal constant float 0x3EE4F8B580000000
@.C335_type_angle3d_difference_angle3d_ = internal constant float 1.800000e+02
@.C314_type_angle3d_difference_angle3d_ = internal constant float 1.000000e+00
@.C313_type_angle3d_difference_angle3d_ = internal constant float 0.000000e+00
@.C363_type_angle3d_difference_angle3d_ = internal constant float 0x3DDB7CDFE0000000

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = distinct !DICompileUnit(language: DW_LANG_Fortran90, file: !3, producer: " F90 Flang - 1.5 2017-05-01", isOptimized: false, flags: "'+flang -emit-llvm -S -c difference_angle3d.f90 -o difference_angle3d.f90.ll'", runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !4, globals: !4, imports: !4, nameTableKind: None)
!3 = !DIFile(filename: "difference_angle3d.f90", directory: "/home/zou/Documents/f-ikos/benchmark/FortranProByzou/f-ikos/Fortran95/real")
!4 = !{}
!5 = distinct !DISubprogram(name: "equal", scope: !6, file: !3, line: 14, type: !7, scopeLine: 14, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!6 = !DIModule(scope: !2, name: "type_angle3d", file: !3)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !10}
!9 = !DIBasicType(name: "logical", size: 32, align: 32, encoding: DW_ATE_boolean)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "angle3d", file: !3, size: 128, align: 32, elements: !11)
!11 = !{!12, !14, !15, !16}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !10, file: !3, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "real", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "sint", scope: !10, file: !3, baseType: !13, size: 32, align: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "cosp", scope: !10, file: !3, baseType: !13, size: 32, align: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "sinp", scope: !10, file: !3, baseType: !13, size: 32, align: 32, offset: 96)
!17 = !DILocation(line: 19, column: 1, scope: !5)
!18 = !DILocation(line: 21, column: 1, scope: !5)
!19 = distinct !DISubprogram(name: "angle3d_deg", scope: !6, file: !3, line: 24, type: !20, scopeLine: 24, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, !13, !13}
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "angle3d", file: !3, size: 128, align: 32, elements: !23)
!23 = !{!24, !25, !26, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !22, file: !3, baseType: !13, size: 32, align: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "sint", scope: !22, file: !3, baseType: !13, size: 32, align: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cosp", scope: !22, file: !3, baseType: !13, size: 32, align: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "sinp", scope: !22, file: !3, baseType: !13, size: 32, align: 32, offset: 96)
!28 = !DILocation(line: 30, column: 1, scope: !19)
!29 = !DILocation(line: 31, column: 1, scope: !19)
!30 = !DILocation(line: 32, column: 1, scope: !19)
!31 = !DILocation(line: 33, column: 1, scope: !19)
!32 = !DILocation(line: 35, column: 1, scope: !19)
!33 = distinct !DISubprogram(name: "dot_product", scope: !6, file: !3, line: 38, type: !34, scopeLine: 38, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!34 = !DISubroutineType(types: !35)
!35 = !{!13, !36, !36}
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "angle3d", file: !3, size: 128, align: 32, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !36, file: !3, baseType: !13, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "sint", scope: !36, file: !3, baseType: !13, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cosp", scope: !36, file: !3, baseType: !13, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "sinp", scope: !36, file: !3, baseType: !13, size: 32, align: 32, offset: 96)
!42 = !DILocation(line: 44, column: 1, scope: !33)
!43 = !DILocation(line: 46, column: 1, scope: !33)
!44 = distinct !DISubprogram(name: "difference_angle3d", scope: !6, file: !3, line: 50, type: !45, scopeLine: 50, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !47, !47, !47}
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "angle3d", file: !3, size: 128, align: 32, elements: !48)
!48 = !{!49, !50, !51, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !47, file: !3, baseType: !13, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "sint", scope: !47, file: !3, baseType: !13, size: 32, align: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cosp", scope: !47, file: !3, baseType: !13, size: 32, align: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "sinp", scope: !47, file: !3, baseType: !13, size: 32, align: 32, offset: 96)
!53 = !DILocation(line: 88, column: 1, scope: !44)
!54 = !DILocation(line: 89, column: 1, scope: !44)
!55 = !DILocation(line: 90, column: 1, scope: !44)
!56 = !DILocation(line: 91, column: 1, scope: !44)
!57 = !DILocation(line: 92, column: 1, scope: !44)
!58 = !DILocation(line: 93, column: 1, scope: !44)
!59 = !DILocation(line: 94, column: 1, scope: !44)
!60 = !DILocation(line: 95, column: 1, scope: !44)
!61 = !DILocation(line: 96, column: 1, scope: !44)
!62 = !DILocation(line: 97, column: 1, scope: !44)
!63 = !DILocation(line: 99, column: 1, scope: !44)
!64 = !DILocation(line: 106, column: 1, scope: !44)
!65 = !DILocation(line: 107, column: 1, scope: !44)
!66 = !DILocation(line: 109, column: 1, scope: !44)
!67 = !DILocation(line: 110, column: 1, scope: !44)
!68 = !DILocation(line: 112, column: 1, scope: !44)
!69 = !DILocation(line: 113, column: 1, scope: !44)
!70 = !DILocation(line: 117, column: 1, scope: !44)
!71 = !DILocation(line: 118, column: 1, scope: !44)
!72 = !DILocation(line: 121, column: 1, scope: !44)
!73 = !DILocation(line: 122, column: 1, scope: !44)
!74 = !DILocation(line: 123, column: 1, scope: !44)
!75 = !DILocation(line: 127, column: 1, scope: !44)
!76 = !DILocation(line: 128, column: 1, scope: !44)
!77 = !DILocation(line: 129, column: 1, scope: !44)
!78 = !DILocation(line: 132, column: 1, scope: !44)
!79 = !DILocation(line: 133, column: 1, scope: !44)
!80 = !DILocation(line: 134, column: 1, scope: !44)
!81 = !DILocation(line: 135, column: 1, scope: !44)
!82 = !DILocation(line: 136, column: 1, scope: !44)
!83 = !DILocation(line: 139, column: 1, scope: !44)
!84 = !DILocation(line: 141, column: 1, scope: !44)
!85 = !DILocation(line: 142, column: 1, scope: !44)
!86 = !DILocation(line: 143, column: 1, scope: !44)
!87 = !DILocation(line: 144, column: 1, scope: !44)
!88 = !DILocation(line: 147, column: 1, scope: !44)
!89 = !DILocation(line: 148, column: 1, scope: !44)
!90 = !DILocation(line: 149, column: 1, scope: !44)
!91 = !DILocation(line: 150, column: 1, scope: !44)
!92 = !DILocation(line: 153, column: 1, scope: !44)
!93 = !DILocation(line: 154, column: 1, scope: !44)
!94 = !DILocation(line: 155, column: 1, scope: !44)
!95 = !DILocation(line: 156, column: 1, scope: !44)
!96 = !DILocation(line: 159, column: 1, scope: !44)
!97 = !DILocation(line: 160, column: 1, scope: !44)
!98 = !DILocation(line: 161, column: 1, scope: !44)
!99 = !DILocation(line: 167, column: 1, scope: !44)
!100 = !DILocation(line: 171, column: 1, scope: !44)
!101 = !DILocation(line: 172, column: 1, scope: !44)
!102 = !DILocation(line: 174, column: 1, scope: !44)
!103 = !DILocation(line: 176, column: 1, scope: !44)
!104 = !DILocation(line: 177, column: 1, scope: !44)
!105 = !DILocation(line: 179, column: 1, scope: !44)
!106 = !DILocation(line: 181, column: 1, scope: !44)
!107 = !DILocation(line: 182, column: 1, scope: !44)
!108 = !DILocation(line: 186, column: 1, scope: !44)
!109 = distinct !DISubprogram(name: "sin2cos", scope: !6, file: !3, line: 189, type: !110, scopeLine: 189, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!110 = !DISubroutineType(types: !111)
!111 = !{!13, !13}
!112 = !DILocation(line: 192, column: 1, scope: !109)
!113 = !DILocation(line: 193, column: 1, scope: !109)
!114 = !DILocation(line: 194, column: 1, scope: !109)
!115 = !DILocation(line: 195, column: 1, scope: !109)
!116 = !DILocation(line: 197, column: 1, scope: !109)
!117 = distinct !DISubprogram(name: "cos2sin", scope: !6, file: !3, line: 200, type: !110, scopeLine: 200, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!118 = !DILocation(line: 203, column: 1, scope: !117)
!119 = !DILocation(line: 204, column: 1, scope: !117)
!120 = !DILocation(line: 205, column: 1, scope: !117)
!121 = !DILocation(line: 206, column: 1, scope: !117)
!122 = !DILocation(line: 208, column: 1, scope: !117)
